# SetDLControlOffset

## Description
Sets the Double Line Preferences control offset.

```pascal
PROCEDURE SetDLControlOffset(controlOffsetDistance : REAL);
```

```python
def vs.SetDLControlOffset(controlOffsetDistance):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|controlOffsetDistance|REAL|The control offset.|

## Remarks
CJG 6-27-06

## Examples
```pascal
SetDLControlOffset(1.0);
```
```python
import vs

# Sets the Double Line Preferences control offset.
controlOffsetDistance = 1.0

vs.SetDLControlOffset(controlOffsetDistance)
```

## See Also
VS Functions:
GetDLControlOffset

## Version
Availability: from VectorWorks12.5

## Category
* Document Settings